References/ASTT/TestSuits/Tests/DeviceDiscovery/TC.DD.NVT.02/TC.DD.NVT.02_REQ_01.xml

<?xml version="1.0" encoding="utf-8" ?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsd="http://schemas.xmlsoap.org/ws/2005/04/discovery" xmlns:wsdp="http://schemas.xmlsoap.org/ws/2006/02/devprof" xmlns:pub="http://schemas.microsoft.com/windows/pub/2005/07">
  <soap:Header>
    <wsa:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:To>
    <wsa:Action>http://schemas.xmlsoap.org/ws/2005/04/discovery/ProbeMatches</wsa:Action>
    <wsa:MessageID>urn:uuid:f2335cb7-2481-41a4-941b-f4a33e27ce6a</wsa:MessageID>
    <wsa:RelatesTo>uuid:09b6ad04-4c7d-49da-afb9-cc9c8963b106</wsa:RelatesTo>
    <wsd:AppSequence InstanceId="45" SequenceId="urn:uuid:55501b84-88d7-4634-bf51-28ebfe734aad" MessageNumber="4"></wsd:AppSequence>
  </soap:Header>
  <soap:Body>
    <wsd:ProbeMatches>
      <wsd:ProbeMatch>
        <wsa:EndpointReference>
          <wsa:Address>urn:uuid:4141d6fa-7630-45e5-97ec-3261da5673a9</wsa:Address>
        </wsa:EndpointReference>
        <wsd:Types>wsdp:Device pub:Computer</wsd:Types>
        <wsd:XAddrs>http://192.168.10.9:5357/4141d6fa-7630-45e5-97ec-3261da5673a9</wsd:XAddrs>
        <wsd:MetadataVersion>2</wsd:MetadataVersion>
      </wsd:ProbeMatch>
    </wsd:ProbeMatches>
  </soap:Body>
</soap:Envelope>